Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: إذ جعل الذين كفروا في قلوبهم الحمية حمية الجاهلية فأنزل الله سكينته على رسوله وعلى المؤمنين وألزمهم كلمة التقوى وكانوا أحق بها وأهلها وكان الله بكل شيء عليما
en: While the Unbelievers got up in their hearts heat and cant - the heat and cant of ignorance,- Allah sent down His Tranquillity to his Messenger and to the Believers, and made them stick close to the command of self-restraint; and well were they entitled to it and worthy of it. And Allah has full knowledge of all things.

source: لقد صدق الله رسوله الرؤيا بالحق لتدخلن المسجد الحرام إن شاء الله آمنين محلقين رءوسكم ومقصرين لا تخافون فعلم ما لم تعلموا فجعل من دون ذلك فتحا قريبا
en: Truly did Allah fulfil the vision for His Messenger: ye shall enter the Sacred Mosque, if Allah wills, with minds secure, heads shaved, hair cut short, and without fear. For He knew what ye knew not, and He granted, besides this, a speedy victory.

source: هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله وكفى بالله شهيدا
en: It is He Who has sent His Messenger with Guidance and the Religion of Truth, to proclaim it over all religion: and enough is Allah for a Witness.

source: محمد رسول الله والذين معه أشداء على الكفار رحماء بينهم تراهم ركعا سجدا يبتغون فضلا من الله ورضوانا سيماهم في وجوههم من أثر السجود ذلك مثلهم في التوراة ومثلهم في الإنجيل كزرع أخرج شطأه فآزره فاستغلظ فاستوى على سوقه يعجب الزراع ليغيظ بهم الكفار وعد الله الذين آمنوا وعملوا الصالحات منهم مغفرة وأجرا عظيما
en: Muhammad is the messenger of Allah; and those who are with him are strong against Unbelievers, (but) compassionate amongst each other. Thou wilt see them bow and prostrate themselves (in prayer), seeking Grace from Allah and (His) Good Pleasure. On their faces are their marks, (being) the traces of their prostration. This is their similitude in the Taurat; and their similitude in the Gospel is: like a seed which sends forth its blade, then makes it strong; it then becomes thick, and it stands on its own stem, (filling) the sowers with wonder and delight. As a result, it fills the Unbelievers with rage at them. Allah has promised those among them who believe and do righteous deeds forgiveness, and a great Reward.

source: يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله واتقوا الله إن الله سميع عليم
en: O Ye who believe! Put not yourselves forward before Allah and His Messenger; but fear Allah: for Allah is He Who hears and knows all things.

source: يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض أن تحبط أعمالكم وأنتم لا تشعرون
en: O ye who believe! Raise not your voices above the voice of the Prophet, nor speak aloud to him in talk, as ye may speak aloud to one another, lest your deeds become vain and ye perceive not.

source: إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم
en: Those that lower their voices in the presence of Allah's Messenger,- their hearts has Allah tested for piety: for them is Forgiveness and a great Reward.

source: إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون
en: Those who shout out to thee from without the inner apartments - most of them lack understanding.

source: ولو أنهم صبروا حتى تخرج إليهم لكان خيرا لهم والله غفور رحيم
en: If only they had patience until thou couldst come out to them, it would be best for them: but Allah is Oft-Forgiving, Most Merciful.

source: يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا أن تصيبوا قوما بجهالة فتصبحوا على ما فعلتم نادمين
en: O ye who believe! If a wicked person comes to you with any news, ascertain the truth, lest ye harm people unwittingly, and afterwards become full of repentance for what ye have done.

source: واعلموا أن فيكم رسول الله لو يطيعكم في كثير من الأمر لعنتم ولكن الله حبب إليكم الإيمان وزينه في قلوبكم وكره إليكم الكفر والفسوق والعصيان أولئك هم الراشدون
en: And know that among you is Allah's Messenger: were he, in many matters, to follow your (wishes), ye would certainly fall into misfortune: But Allah has endeared the Faith to you, and has made it beautiful in your hearts, and He has made hateful to you Unbelief, wickedness, and rebellion: such indeed are those who walk in righteousness;-

source: فضلا من الله ونعمة والله عليم حكيم
en: A Grace and Favour from Allah; and Allah is full of Knowledge and Wisdom.

source: وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين
en: If two parties among the Believers fall into a quarrel, make ye peace between them: but if one of them transgresses beyond bounds against the other, then fight ye (all) against the one that transgresses until it complies with the command of Allah; but if it complies, then make peace between them with justice, and be fair: for Allah loves those who are fair (and just).

source: إنما المؤمنون إخوة فأصلحوا بين أخويكم واتقوا الله لعلكم ترحمون
en: The Believers are but a single Brotherhood: So make peace and reconciliation between your two (contending) brothers; and fear Allah, that ye may receive Mercy.

source: يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن ولا تلمزوا أنفسكم ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان ومن لم يتب فأولئك هم الظالمون
en: O ye who believe! Let not some men among you laugh at others: It may be that the (latter) are better than the (former): Nor let some women laugh at others: It may be that the (latter are better than the (former): Nor defame nor be sarcastic to each other, nor call each other by (offensive) nicknames: Ill-seeming is a name connoting wickedness, (to be used of one) after he has believed: And those who do not desist are (indeed) doing wrong.

source: يا أيها الذين آمنوا اجتنبوا كثيرا من الظن إن بعض الظن إثم ولا تجسسوا ولا يغتب بعضكم بعضا أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه واتقوا الله إن الله تواب رحيم
en: O ye who believe! Avoid suspicion as much (as possible): for suspicion in some cases is a sin: And spy not on each other behind their backs. Would any of you like to eat the flesh of his dead brother? Nay, ye would abhor it... But fear Allah: For Allah is Oft-Returning, Most Merciful.

source: يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير
en: O mankind! We created you from a single (pair) of a male and a female, and made you into nations and tribes, that ye may know each other (not that ye may despise (each other). Verily the most honoured of you in the sight of Allah is (he who is) the most righteous of you. And Allah has full knowledge and is well acquainted (with all things).

source: قالت الأعراب آمنا قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم وإن تطيعوا الله ورسوله لا يلتكم من أعمالكم شيئا إن الله غفور رحيم
en: The desert Arabs say, "We believe." Say, "Ye have no faith; but ye (only) say, 'We have submitted our wills to Allah,' For not yet has Faith entered your hearts. But if ye obey Allah and His Messenger, He will not belittle aught of your deeds: for Allah is Oft-Forgiving, Most Merciful."

source: إنما المؤمنون الذين آمنوا بالله ورسوله ثم لم يرتابوا وجاهدوا بأموالهم وأنفسهم في سبيل الله أولئك هم الصادقون
en: Only those are Believers who have believed in Allah and His Messenger, and have never since doubted, but have striven with their belongings and their persons in the Cause of Allah: Such are the sincere ones.

source: قل أتعلمون الله بدينكم والله يعلم ما في السماوات وما في الأرض والله بكل شيء عليم
en: Say: "What! Will ye instruct Allah about your religion? But Allah knows all that is in the heavens and on earth: He has full knowledge of all things.

source: يمنون عليك أن أسلموا قل لا تمنوا علي إسلامكم بل الله يمن عليكم أن هداكم للإيمان إن كنتم صادقين
en: They impress on thee as a favour that they have embraced Islam. Say, "Count not your Islam as a favour upon me: Nay, Allah has conferred a favour upon you that He has guided you to the faith, if ye be true and sincere.

source: إن الله يعلم غيب السماوات والأرض والله بصير بما تعملون
en: "Verily Allah knows the secrets of the heavens and the earth: and Allah Sees well all that ye do."

source: ق والقرآن المجيد
en: Qaf: By the Glorious Qur'an (Thou art Allah's Messenger).

source: بل عجبوا أن جاءهم منذر منهم فقال الكافرون هذا شيء عجيب
en: But they wonder that there has come to them a Warner from among themselves. So the Unbelievers say: "This is a wonderful thing!

source: أإذا متنا وكنا ترابا ذلك رجع بعيد
en: "What! When we die and become dust, (shall we live again?) That is a (sort of) return far (from our understanding)."

source: قد علمنا ما تنقص الأرض منهم وعندنا كتاب حفيظ
en: We already know how much of them the earth takes away: With Us is a record guarding (the full account).

source: بل كذبوا بالحق لما جاءهم فهم في أمر مريج
en: But they deny the Truth when it comes to them: so they are in a confused state.

source: أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيناها وما لها من فروج
en: Do they not look at the sky above them?- How We have made it and adorned it, and there are no flaws in it?

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل زوج بهيج
en: And the earth- We have spread it out, and set thereon mountains standing firm, and produced therein every kind of beautiful growth (in pairs)-

source: تبصرة وذكرى لكل عبد منيب
en: To be observed and commemorated by every devotee turning (to Allah).

source: ونزلنا من السماء ماء مباركا فأنبتنا به جنات وحب الحصيد
en: And We send down from the sky rain charted with blessing, and We produce therewith gardens and Grain for harvests;

source: والنخل باسقات لها طلع نضيد
en: And tall (and stately) palm-trees, with shoots of fruit-stalks, piled one over another;-

source: رزقا للعباد وأحيينا به بلدة ميتا كذلك الخروج
en: As sustenance for (Allah's) Servants;- and We give (new) life therewith to land that is dead: Thus will be the Resurrection.

source: كذبت قبلهم قوم نوح وأصحاب الرس وثمود
en: Before them was denied (the Hereafter) by the People of Noah, the Companions of the Rass, the Thamud,

source: وعاد وفرعون وإخوان لوط
en: The 'Ad, Pharaoh, the brethren of Lut,

source: وأصحاب الأيكة وقوم تبع كل كذب الرسل فحق وعيد
en: The Companions of the Wood, and the People of Tubba'; each one (of them) rejected the messengers, and My warning was duly fulfilled (in them).

source: أفعيينا بالخلق الأول بل هم في لبس من خلق جديد
en: Were We then weary with the first Creation, that they should be in confused doubt about a new Creation?

source: ولقد خلقنا الإنسان ونعلم ما توسوس به نفسه ونحن أقرب إليه من حبل الوريد
en: It was We Who created man, and We know what dark suggestions his soul makes to him: for We are nearer to him than (his) jugular vein.

source: إذ يتلقى المتلقيان عن اليمين وعن الشمال قعيد
en: Behold, two (guardian angels) appointed to learn (his doings) learn (and noted them), one sitting on the right and one on the left.

source: ما يلفظ من قول إلا لديه رقيب عتيد
en: Not a word does he utter but there is a sentinel by him, ready (to note it).

source: وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد
en: And the stupor of death will bring Truth (before his eyes): "This was the thing which thou wast trying to escape!"

source: ونفخ في الصور ذلك يوم الوعيد
en: And the Trumpet shall be blown: that will be the Day whereof Warning (had been given).

source: وجاءت كل نفس معها سائق وشهيد
en: And there will come forth every soul: with each will be an (angel) to drive, and an (angel) to bear witness.

source: لقد كنت في غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد
en: (It will be said:) "Thou wast heedless of this; now have We removed thy veil, and sharp is thy sight this Day!"

source: وقال قرينه هذا ما لدي عتيد
en: And his Companion will say: "Here is (his Record) ready with me!"

source: ألقيا في جهنم كل كفار عنيد
en: (The sentence will be:) "Throw, throw into Hell every contumacious Rejecter (of Allah)!-

source: مناع للخير معتد مريب
en: "Who forbade what was good, transgressed all bounds, cast doubts and suspicions;

source: الذي جعل مع الله إلها آخر فألقياه في العذاب الشديد
en: "Who set up another god beside Allah: Throw him into a severe penalty."

source: قال قرينه ربنا ما أطغيته ولكن كان في ضلال بعيد
en: His Companion will say: "Our Lord! I did not make him transgress, but he was (himself) far astray."

source: قال لا تختصموا لدي وقد قدمت إليكم بالوعيد
en: He will say: "Dispute not with each other in My Presence: I had already in advance sent you Warning.

source: ما يبدل القول لدي وما أنا بظلام للعبيد
en: "The Word changes not before Me, and I do not the least injustice to My Servants."

source: يوم نقول لجهنم هل امتلأت وتقول هل من مزيد
en: One Day We will ask Hell, "Art thou filled to the full?" It will say, "Are there any more (to come)?"

source: وأزلفت الجنة للمتقين غير بعيد
en: And the Garden will be brought nigh to the Righteous,- no more a thing distant.

source: هذا ما توعدون لكل أواب حفيظ
en: (A voice will say:) "This is what was promised for you,- for every one who turned (to Allah) in sincere repentance, who kept (His Law),

source: من خشي الرحمن بالغيب وجاء بقلب منيب
en: "Who feared (Allah) Most Gracious Unseen, and brought a heart turned in devotion (to Him):

source: ادخلوها بسلام ذلك يوم الخلود
en: "Enter ye therein in Peace and Security; this is a Day of Eternal Life!"

source: لهم ما يشاءون فيها ولدينا مزيد
en: There will be for them therein all that they wish,- and more besides in Our Presence.

source: وكم أهلكنا قبلهم من قرن هم أشد منهم بطشا فنقبوا في البلاد هل من محيص
en: But how many generations before them did We destroy (for their sins),- stronger in power than they? Then did they wander through the land: was there any place of escape (for them)?

source: إن في ذلك لذكرى لمن كان له قلب أو ألقى السمع وهو شهيد
en: Verily in this is a Message for any that has a heart and understanding or who gives ear and earnestly witnesses (the truth).

source: ولقد خلقنا السماوات والأرض وما بينهما في ستة أيام وما مسنا من لغوب
en: We created the heavens and the earth and all between them in Six Days, nor did any sense of weariness touch Us.

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب
en: Bear, then, with patience, all that they say, and celebrate the praises of thy Lord, before the rising of the sun and before (its) setting.

source: ومن الليل فسبحه وأدبار السجود
en: And during part of the night, (also,) celebrate His praises, and (so likewise) after the postures of adoration.

source: واستمع يوم يناد المناد من مكان قريب
en: And listen for the Day when the Caller will call out from a place quiet near,-

source: يوم يسمعون الصيحة بالحق ذلك يوم الخروج
en: The Day when they will hear a (mighty) Blast in (very) truth: that will be the Day of Resurrection.

source: إنا نحن نحيي ونميت وإلينا المصير
en: Verily it is We Who give Life and Death; and to Us is the Final Goal-

source: يوم تشقق الأرض عنهم سراعا ذلك حشر علينا يسير
en: The Day when the Earth will be rent asunder, from (men) hurrying out: that will be a gathering together,- quite easy for Us.

source: نحن أعلم بما يقولون وما أنت عليهم بجبار فذكر بالقرآن من يخاف وعيد
en: We know best what they say; and thou art not one to overawe them by force. So admonish with the Qur'an such as fear My Warning!

source: والذاريات ذروا
en: By the (Winds) that scatter broadcast;

source: فالحاملات وقرا
en: And those that lift and bear away heavy weights;

source: فالجاريات يسرا
en: And those that flow with ease and gentleness;

source: فالمقسمات أمرا
en: And those that distribute and apportion by Command;-

source: إنما توعدون لصادق
en: Verily that which ye are promised is true;

source: وإن الدين لواقع
en: And verily Judgment and Justice must indeed come to pass.

source: والسماء ذات الحبك
en: By the Sky with (its) numerous Paths,

source: إنكم لفي قول مختلف
en: Truly ye are in a doctrine discordant,

source: يؤفك عنه من أفك
en: Through which are deluded (away from the Truth) such as would be deluded.

source: قتل الخراصون
en: Woe to the falsehood-mongers,-

source: الذين هم في غمرة ساهون
en: Those who (flounder) heedless in a flood of confusion:

source: يسألون أيان يوم الدين
en: They ask, "When will be the Day of Judgment and Justice?"

source: يوم هم على النار يفتنون
en: (It will be) a Day when they will be tried (and tested) over the Fire!

source: ذوقوا فتنتكم هذا الذي كنتم به تستعجلون
en: "Taste ye your trial! This is what ye used to ask to be hastened!"

source: آخذين ما آتاهم ربهم إنهم كانوا قبل ذلك محسنين
en: Taking joy in the things which their Lord gives them, because, before then, they lived a good life.

source: كانوا قليلا من الليل ما يهجعون
en: They were in the habit of sleeping but little by night,

source: وبالأسحار هم يستغفرون
en: And in the hour of early dawn, they (were found) praying for Forgiveness;

source: وفي أموالهم حق للسائل والمحروم
en: And in their wealth and possessions (was remembered) the right of the (needy,) him who asked, and him who (for some reason) was prevented (from asking).

source: وفي الأرض آيات للموقنين
en: On the earth are signs for those of assured Faith,

source: وفي أنفسكم أفلا تبصرون
en: As also in your own selves: Will ye not then see?

source: وفي السماء رزقكم وما توعدون
en: And in heaven is your Sustenance, as (also) that which ye are promised.

source: فورب السماء والأرض إنه لحق مثل ما أنكم تنطقون
en: Then, by the Lord of heaven and earth, this is the very Truth, as much as the fact that ye can speak intelligently to each other.

source: هل أتاك حديث ضيف إبراهيم المكرمين
en: Has the story reached thee, of the honoured guests of Abraham?

source: إذ دخلوا عليه فقالوا سلاما قال سلام قوم منكرون
en: Behold, they entered his presence, and said: "Peace!" He said, "Peace!" (and thought, "These seem) unusual people."

source: فراغ إلى أهله فجاء بعجل سمين
en: Then he turned quickly to his household, brought out a fatted calf,

source: فقربه إليهم قال ألا تأكلون
en: And placed it before them.. he said, "Will ye not eat?"

source: فأوجس منهم خيفة قالوا لا تخف وبشروه بغلام عليم
en: (When they did not eat), He conceived a fear of them. They said, "Fear not," and they gave him glad tidings of a son endowed with knowledge.

source: فأقبلت امرأته في صرة فصكت وجهها وقالت عجوز عقيم
en: But his wife came forward (laughing) aloud: she smote her forehead and said: "A barren old woman!"

source: قالوا كذلك قال ربك إنه هو الحكيم العليم
en: They said, "Even so has thy Lord spoken: and He is full of Wisdom and Knowledge."

source: لنرسل عليهم حجارة من طين
en: "To bring on, on them, (a shower of) stones of clay (brimstone),

source: مسومة عند ربك للمسرفين
en: "Marked as from thy Lord for those who trespass beyond bounds."

source: فأخرجنا من كان فيها من المؤمنين
en: Then We evacuated those of the Believers who were there,

source: فما وجدنا فيها غير بيت من المسلمين
en: But We found not there any just (Muslim) persons except in one house:

source: وتركنا فيها آية للذين يخافون العذاب الأليم
en: And We left there a Sign for such as fear the Grievous Penalty.

source: وفي موسى إذ أرسلناه إلى فرعون بسلطان مبين
en: And in Moses (was another Sign): Behold, We sent him to Pharaoh, with authority manifest.

source: فتولى بركنه وقال ساحر أو مجنون
en: But (Pharaoh) turned back with his Chiefs, and said, "A sorcerer, or one possessed!"

source: فأخذناه وجنوده فنبذناهم في اليم وهو مليم
en: So We took him and his forces, and threw them into the sea; and his was the blame.

source: وفي عاد إذ أرسلنا عليهم الريح العقيم
en: And in the 'Ad (people) (was another Sign): Behold, We sent against them the devastating Wind:

source: ما تذر من شيء أتت عليه إلا جعلته كالرميم
en: It left nothing whatever that it came up against, but reduced it to ruin and rottenness.

source: وفي ثمود إذ قيل لهم تمتعوا حتى حين
en: And in the Thamud (was another Sign): Behold, they were told, "Enjoy (your brief day) for a little while!"

source: فعتوا عن أمر ربهم فأخذتهم الصاعقة وهم ينظرون
en: But they insolently defied the Command of their Lord: So the stunning noise (of an earthquake) seized them, even while they were looking on.

source: فما استطاعوا من قيام وما كانوا منتصرين
en: Then they could not even stand (on their feet), nor could they help themselves.

source: وقوم نوح من قبل إنهم كانوا قوما فاسقين
en: So were the People of Noah before them for they wickedly transgressed.

source: والسماء بنيناها بأيد وإنا لموسعون
en: With power and skill did We construct the Firmament: for it is We Who create the vastness of pace.

source: والأرض فرشناها فنعم الماهدون
en: And We have spread out the (spacious) earth: How excellently We do spread out!

source: ومن كل شيء خلقنا زوجين لعلكم تذكرون
en: And of every thing We have created pairs: That ye may receive instruction.

source: ففروا إلى الله إني لكم منه نذير مبين
en: Hasten ye then (at once) to Allah: I am from Him a Warner to you, clear and open!

source: ولا تجعلوا مع الله إلها آخر إني لكم منه نذير مبين
en: And make not another an object of worship with Allah: I am from Him a Warner to you, clear and open!

source: كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون
en: Similarly, no messenger came to the Peoples before them, but they said (of him) in like manner, "A sorcerer, or one possessed"!

source: أتواصوا به بل هم قوم طاغون
en: Is this the legacy they have transmitted, one to another? Nay, they are themselves a people transgressing beyond bounds!

source: فتول عنهم فما أنت بملوم
en: So turn away from them: not thine is the blame.

source: وذكر فإن الذكرى تنفع المؤمنين
en: But teach (thy Message) for teaching benefits the Believers.

source: وما خلقت الجن والإنس إلا ليعبدون
en: I have only created Jinns and men, that they may serve Me.

source: ما أريد منهم من رزق وما أريد أن يطعمون
en: No Sustenance do I require of them, nor do I require that they should feed Me.

source: إن الله هو الرزاق ذو القوة المتين
en: For Allah is He Who gives (all) Sustenance,- Lord of Power,- Steadfast (for ever).

source: فإن للذين ظلموا ذنوبا مثل ذنوب أصحابهم فلا يستعجلون
en: For the Wrong-doers, their portion is like unto the portion of their fellows (of earlier generations): then let them not ask Me to hasten (that portion)!

source: فويل للذين كفروا من يومهم الذي يوعدون
en: Woe, then, to the Unbelievers, on account of that Day of theirs which they have been promised!

source: والطور
en: By the Mount (of Revelation);

source: وكتاب مسطور
en: By a Decree inscribed

source: في رق منشور
en: In a Scroll unfolded;

source: والبيت المعمور
en: By the much-frequented Fane;

source: والسقف المرفوع
en: By the Canopy Raised High;

source: والبحر المسجور
en: And by the Ocean filled with Swell;-

source: إن عذاب ربك لواقع
en: Verily, the Doom of thy Lord will indeed come to pass;-

source: ما له من دافع
en: There is none can avert it;-

source: يوم تمور السماء مورا
en: On the Day when the firmament will be in dreadful commotion.

source: وتسير الجبال سيرا
en: And the mountains will fly hither and thither.

source: فويل يومئذ للمكذبين
en: Then woe that Day to those that treat (Truth) as Falsehood;-

source: الذين هم في خوض يلعبون
en: That play (and paddle) in shallow trifles.

source: يوم يدعون إلى نار جهنم دعا
en: That Day shall they be thrust down to the Fire of Hell, irresistibly.

source: هذه النار التي كنتم بها تكذبون
en: "This:, it will be said, "Is the Fire,- which ye were wont to deny!

source: أفسحر هذا أم أنتم لا تبصرون
en: "Is this then a fake, or is it ye that do not see?

source: اصلوها فاصبروا أو لا تصبروا سواء عليكم إنما تجزون ما كنتم تعملون
en: "Burn ye therein: the same is it to you whether ye bear it with patience, or not: Ye but receive the recompense of your (own) deeds."

source: إن المتقين في جنات ونعيم
en: As to the Righteous, they will be in Gardens, and in Happiness,-
